/*************************************************************************
	> File Name: main.c
	> Author: snowflake
	> Mail: 278121951@qq.com 
	> Created Time: Sat 30 Jan 2021 10:07:03 PM CST
	>
	>
	> 本文件的入口点是：
	>  - ilinux_main           内核跳转到该方法进行C语言模式
 ************************************************************************/
#include "kernel.h"

/*************************************************************************
	> 程序入口
 ************************************************************************/
void ilinux_main(void) 
{
	// 1. 清理屏幕
	clear_screen();
	printf("#root ");

	// 2. 启动定时任务
	clock_task();

	for (;;);
}
